UNO_online/app/controllers/application_controller.rb

  def current_user
    @current_user ||= User.find_by(id: session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1