UNO_online/app/controllers/games_controller.rb

  def join
    game = Game.find_by(code: params[:code].to_s.upcase.strip)

    if game.nil?
      redirect_to root_path, alert: "Комната с таким кодом не найдена"
    elsif game.players.exists?(user: current_user)
      redirect_to game
    elsif game.full?
      redirect_to root_path, alert: "Комната уже заполнена"
    else
      game.players.create!(user: current_user, position: game.players.count)
---
SELECT COUNT(*) FROM "players" WHERE "players"."game_id" = 16