UNO_online/app/controllers/games_controller.rb

SELECT "games".* FROM "games" WHERE "games"."visibility" = 'public' ORDER BY "games"."created_at" DESC
---
  def index
    @public_games = Game.where(visibility: "public")
                         .order(created_at: :desc)
                         .includes(:players)

INSERT INTO "games" ("code", "status", "current_player_id", "direction", "top_card", "deck_state", "winner_id", "created_at", "updated_at", "visibility", "max_players", "host_id") VALUES ('NW0TCI', 'waiting', NULL, 'clockwise', NULL, NULL, NULL, '2026-10-02 07:28:45.193713', '2026-10-02 07:28:45.193713', 'public', 4, 5) RETURNING "id"
INSERT INTO "players" ("game_id", "user_id", "position", "hand", "has_called_uno", "created_at", "updated_at", "ready") VALUES (22, 5, 0, '[]', FALSE, '2026-10-02 07:28:45.212187', '2026-10-02 07:28:45.212187', FALSE) RETURNING "id"
---
  def create
    game = Game.new(game_params)
    game.host = current_user
    game.players.build(user: current_user, position: 0)

    if game.save

SELECT "games".* FROM "games" WHERE "games"."code" = '6TFWDM' LIMIT 1
SELECT 1 AS one FROM "games" WHERE "games"."code" = 'NW0TCI' LIMIT 1
SELECT 1 AS one FROM "players" WHERE "players"."game_id" = 16 AND "players"."user_id" = 5 LIMIT 1
INSERT INTO "players" ("game_id", "user_id", "position", "hand", "has_called_uno", "created_at", "updated_at", "ready") VALUES (16, 5, 2, '[]', FALSE, '2026-10-02 07:29:04.321984', '2026-10-02 07:29:04.321984', FALSE) RETURNING "id"
---
  def join
    game = Game.find_by(code: params[:code].to_s.upcase.strip)

    if game.nil?
      redirect_to root_path, alert: "Комната с таким кодом не найдена"
    elsif game.players.exists?(user: current_user)
      redirect_to game
    elsif game.status == "playing"
      redirect_to root_path, alert: "В этой комнате сейчас идёт игра, дождитесь её окончания"
    elsif game.full?
      redirect_to root_path, alert: "Комната уже заполнена"
    else
      game.players.create!(user: current_user, position: game.next_position)

UPDATE "games" SET "status" = 'playing', "updated_at" = '2026-10-02 08:08:58.948346' WHERE "games"."id" = 16
UPDATE "players" SET "updated_at" = '2026-10-02 08:08:49.821419', "ready" = FALSE WHERE "players"."id" = 58
---
  def ready
    player = @game.players.find_by(user: current_user)
    if player.nil?
      redirect_to root_path, alert: "Вы больше не в этой комнате" and return
    end

    player.update!(ready: !player.ready)

DELETE FROM "games" WHERE "games"."id" = 13
---
  def destroy
    if @game.host_id == current_user.id
      @game.destroy!

SELECT 1 AS one FROM "players" WHERE "players"."game_id" = 16 AND "players"."user_id" = 1 LIMIT 1
---
  def require_membership
    return if @game.players.exists?(user: current_user)