UNO_online/app/controllers/registrations_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ('Timofey1', 'battimnik2006@gmail.com', '$2a$12$Bo7rHY2tBeLXoGT6edCUTevXtas0qquyBRi8OCmxiDssbRiS04lGG', '2026-10-08 21:22:07.434341', '2026-10-08 21:22:07.434341') RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save