UNO_online/app/views/games/index.html.erb

SELECT COUNT(*) FROM "players" WHERE "players"."game_id" = 2
---
                <p class="room-card__meta">
                  <%= game.players.size %>/<%= game.max_players %> игроков

SELECT 1 AS one FROM "players" WHERE "players"."game_id" = 16 AND "players"."user_id" = 1 LIMIT 1
---
              </div>
              <% if game.players.exists?(user: current_user) %>