UNO_online/app/views/games/play.html.erb

SELECT COUNT(*) FROM "players" WHERE "players"."game_id" = 16
---
    <p style="color: var(--text-faint); margin-top: var(--space-5)">
      Игровой стол — следующий этап разработки. Все <%= @game.players.size %> игроков