UNO_online/app/views/games/show.html.erb

SELECT COUNT(*) FROM "players" WHERE "players"."game_id" = 16
---
          · <%= @game.visibility == "private" ? "Приватная" : "Публичная" %>
          · <%= @game.players.size %>/<%= @game.max_players %> игроков