UNO_online/app/models/game.rb

DELETE FROM "players" WHERE "players"."id" = 35
---
  def remove_player!(user)
    player = players.find_by(user: user)
    return unless player

    was_host = host_id == user.id
    player.destroy!

UPDATE "games" SET "status" = 'waiting', "winner_id" = 4, "updated_at" = '2026-10-02 08:09:13.865475' WHERE "games"."id" = 16
UPDATE "players" SET "ready" = FALSE WHERE ("players"."id") IN (SELECT "players"."id" FROM "players" WHERE "players"."game_id" = 16 ORDER BY "players"."position" ASC)
---
  def conclude_by_forfeit!
    remaining_player = players.first

    update!(
      status: "waiting",
      winner: remaining_player.user,
      current_player: nil,
      top_card: nil,
      deck_state: nil
    )

    players.update_all(ready: false)

SELECT 1 AS one FROM "games" WHERE "games"."code" = 'NW0TCI' LIMIT 1
---
  def generate_code
    return if code.present?

    self.code = loop do
      candidate = SecureRandom.alphanumeric(6).upcase
      break candidate unless Game.exists?(code: candidate)

UPDATE "games" SET "updated_at" = '2026-10-02 08:09:05.034690', "host_id" = 4 WHERE "games"."id" = 16
UPDATE "players" SET "position" = 0 WHERE "players"."id" = 55
---
  def reassign_positions!
    players.order(:position).each_with_index do |player, index|
      player.update_column(:position, index) if player.position != index